config/gptel/sessions/tracing.org
#+title: GPTEL Agent Tracing
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle tracing.el
#+auto_tangle: y

* Introduction

Agent tracing captures the complete execution flow of subagents, including:
- Task delegation (which agent was called, with what prompt)
- Streaming LLM responses (real-time capture of response chunks)
- Tool calls (which tools were invoked with what arguments)
- Results (what the agent returned)
- Timing and hierarchy (parent/child relationships, depth)

All traces are stored both in the global registry (for active session access)
and on disk (for persistence and later analysis).

This module provides:
- Trace creation and completion
- Tool call recording

* Tool Usage Capture Feature

** Overview

The tool usage capture feature extends gptel session saving to record complete
information about every tool invocation during agent execution. This provides
a detailed audit trail of:

- Which tools were called (tool names)
- What arguments were provided (serialized as Lisp plists)
- What results were returned (previews for small results, separate files for large)
- When tools were invoked (timestamps)
- Which agent invoked them (trace association)

This data is captured for subagents (explorer, planner, etc.) running in hidden
buffers and enables session replay, debugging, and analysis of agent behavior.

** What Gets Captured

*** Subagent Tool Calls (✅ Fully Captured)
All tool invocations within subagent execution are captured with:
- API-provided tool use IDs (e.g., ~toolu_01ABC...~ from Claude, ~call_XYZ...~ from OpenAI)
- Tool name (e.g., "Read", "Glob", "Grep")
- Arguments as Lisp plist strings (e.g., ~(:file_path "~/file.txt")~)
- Results:
  - Small results (<1KB): Stored inline as ~result_preview~
  - Large results (≥1KB): Saved to ~jf/gptel-session-trace-tool-results-dirname/TOOL_ID.txt~, preview truncated to 200 chars
- Timestamp of tool invocation
- Error status (if tool call failed)

*** Main Conversation Tool Calls (⚠️ Not Currently Captured)
Tool calls in the main conversation (e.g., the Agent tool itself) are NOT captured
in structured form because:
- Main conversation uses gptel's stream processor, not callback-based tool handling
- Wrapping callbacks breaks streaming (responses wouldn't appear in buffer)
- Tool usage is visible in response content but not as structured metadata

The Agent tool invocation is visible in the response markdown but not in ~session_tool_calls~.

** Reading Session Files

*** Session Directory Structure

#+begin_example
~/gptel-sessions/SESSION_ID/
├── metadata.json              # Session-level metadata with tool calls
├── message-N.md               # User messages
├── response-N.md              # LLM responses
├── jf/gptel-session-trace-tool-results-dirname/              # Large tool results from main conversation
│   └── TOOL_ID.txt
└── traces/                    # Subagent execution traces
    └── trace-N/
        ├── metadata.json      # Trace-level metadata with tool calls
        ├── prompt.txt         # Subagent initial prompt
        ├── response-N.txt     # Streaming response chunks
        ├── result.txt         # Final subagent result
        └── jf/gptel-session-trace-tool-results-dirname/      # Large tool results from this trace
            └── TOOL_ID.txt
#+end_example

*** Session Metadata Format

The ~metadata.json~ file contains:

#+begin_src json
{
  "session_id": "20260118-180624-gpt-4o",
  "model": "gpt-4o",
  "created": "2026-01-18T18:06:24Z",
  "tree": { /* conversation tree */ },
  "agent_traces": [
    {
      "trace_id": "trace-1",
      "agent_type": "explorer",
      "description": "Read Brewfile",
      "prompt_preview": "Locate the Brewfile...",
      "timestamp_start": "2026-01-18T18:06:26Z",
      "timestamp_end": "2026-01-18T18:07:04Z",
      "status": "completed",
      "parent_trace_id": null,
      "depth": 0,
      "tool_calls": [
        {
          "tool_use_id": "toolu_016Jk7BpspkjSBQNt2Xi4bn4",
          "tool_name": "Glob",
          "timestamp": "2026-01-18T18:06:30Z",
          "args_str": "(:pattern \"Brewfile\" :path \"~\")",
          "result_preview": "error Error: Executable 'tree' not found",
          "result_file": null,
          "error": null
        },
        {
          "tool_use_id": "toolu_015UwcuikDaZYowa5nkiDk4H",
          "tool_name": "Read",
          "timestamp": "2026-01-18T18:06:40Z",
          "args_str": "(:file_path \"~/Brewfile\")",
          "result_preview": "tap \"hashicorp/tap\"...",
          "result_file": "toolu_015UwcuikDaZYowa5nkiDk4H.txt",
          "error": null
        }
      ],
      "associated_nodes": ["message-1", "response-1"]
    }
  ]
}
#+end_src

*** Tool Call Fields

- ~tool_use_id~: Unique identifier from the LLM API (stable, not generated by us)
- ~tool_name~: Name of the tool that was invoked
- ~timestamp~: When the tool was called (ISO 8601 format)
- ~args_str~: Tool arguments serialized as Lisp plist string using ~prin1-to-string~
- ~result_preview~: First 200-500 chars of result (or full result if small)
- ~result_file~: Filename in ~jf/gptel-session-trace-tool-results-dirname/~ directory (only for large results)
- ~error~: Error message if tool call failed (usually null)

*** Trace Metadata Format

Each trace directory contains its own ~metadata.json~:

#+begin_src json
{
  "trace_id": "trace-1",
  "messages": [
    {"id": "prompt.txt", "file": "prompt.txt", "timestamp": "...", "tokens": 0},
    {"id": "response-0.txt", "file": "response-0.txt", "timestamp": "...", "tokens": 0},
    {"id": "result.txt", "file": "result.txt", "timestamp": "...", "tokens": 0}
  ],
  "tool_calls": [ /* Same format as session metadata */ ],
  "total_tokens": 0
}
#+end_src

This provides the same tool call data at trace level for local analysis.

** Implementation Architecture

*** Component Dependencies

#+begin_example
                         ┌──────────────────────┐
                         │   gptel-request      │
                         │ (streaming & tools)  │
                         └──────────┬───────────┘
                                    │
                    ┌───────────────┼───────────────┐
                    │               │               │
            ┌───────▼──────┐ ┌─────▼──────┐ ┌─────▼──────┐
            │ gptel-agent  │ │   Main     │ │   FSM      │
            │   --task     │ │Conversation│ │  :tool-use │
            └───────┬──────┘ └─────┬──────┘ └─────┬──────┘
                    │               │               │
         ┌──────────▼───────────────▼───────────────▼─────────┐
         │           hooks.el (Advice Layer)                   │
         │  ┌────────────────────────────────────────────┐   │
         │  │ jf/gptel--trace-agent-task                 │   │
         │  │  - Wraps agent task creation               │   │
         │  │  - Creates trace in registry               │   │
         │  │  - Wraps completion callback               │   │
         │  └────────────────────────────────────────────┘   │
         │  ┌────────────────────────────────────────────┐   │
         │  │ jf/gptel--inject-session-context           │   │
         │  │  - Adds session-id to request context      │   │
         │  └────────────────────────────────────────────┘   │
         │  ┌────────────────────────────────────────────┐   │
         │  │ jf/gptel--capture-subagent-messages        │   │
         │  │  - Wraps callback (subagents only)         │   │
         │  │  - Intercepts 'tool-result events          │   │
         │  │  - Calls recording functions               │   │
         │  └─────────────────┬──────────────────────────┘   │
         └────────────────────┼───────────────────────────────┘
                              │
         ┌────────────────────▼───────────────────────────────┐
         │          tracing.el (Recording Layer)              │
         │  ┌────────────────────────────────────────────┐   │
         │  │ jf/gptel--record-complete-tool-call        │   │
         │  │  - Records tool call with all data         │   │
         │  │  - Writes to session metadata              │   │
         │  │  - Writes to trace metadata (alist)        │   │
         │  │  - Saves large results to files            │   │
         │  └────────────────────────────────────────────┘   │
         │  ┌────────────────────────────────────────────┐   │
         │  │ jf/gptel--save-trace-message               │   │
         │  │  - Saves streaming response chunks         │   │
         │  └────────────────────────────────────────────┘   │
         └────────────────────────────────────────────────────┘
                              │
         ┌────────────────────▼───────────────────────────────┐
         │         registry.el (State Management)             │
         │  - Session-id → session data mapping               │
         │  - Trace stack for hierarchy                       │
         │  - Buffer-local variables                          │
         └────────────────────────────────────────────────────┘
#+end_example

*** Data Flow for Tool Capture

#+begin_example
User invokes Agent tool in main conversation
    │
    ├─→ [Main Conversation - No callback wrapping]
    │   - Stream processor handles text insertion
    │   - No tool capture (maintains transparency)
    │   - Response appears normally in buffer
    │
    └─→ gptel-agent--task spawns subagent
            │
            ▼
        jf/gptel--trace-agent-task (advice)
            │
            ├─→ Create trace entry in registry
            │   - Generate trace-id
            │   - Push to trace stack
            │   - Record start time
            │
            ├─→ Inject session-id into context
            │   - Overlay property for subagents
            │
            └─→ Wrap callback
                    │
                    ▼
        Subagent makes API request
            │
            ├─→ jf/gptel--inject-session-context
            │   - Propagates session-id
            │
            └─→ jf/gptel--capture-subagent-messages
                    │
                    ├─→ Wrap callback (existing-callback present)
                    │   - Install response interceptor
                    │
                    └─→ Callback receives events:
                            │
                            ├─→ 'string → Save to trace
                            │
                            ├─→ 'tool-result → CAPTURE TOOLS
                            │   │
                            │   └─→ Extract from FSM info :tool-use
                            │       - Has :id, :name, :args, :result
                            │       - Call jf/gptel--record-complete-tool-call
                            │           │
                            │           ├─→ Convert plist to alist
                            │           │
                            │           ├─→ Check result size
                            │           │   - <1KB: inline preview
                            │           │   - ≥1KB: save to file
                            │           │
                            │           ├─→ Update session metadata
                            │           │   - agent_traces[N].tool_calls[]
                            │           │
                            │           └─→ Update trace metadata
                            │               - traces/trace-N/metadata.json
                            │
                            └─→ 'stream-end → Mark complete
                                    │
                                    └─→ jf/gptel--complete-trace
                                        - Pop trace stack
                                        - Set end time
#+end_example

*** Key Design Decisions

**** 1. Capture at 'tool-result Event

**Rationale**: Tool execution is asynchronous. The ~'tool-call~ event fires before
execution, but results aren't available yet. The ~'tool-result~ event fires AFTER
all tools complete, and the FSM info plist contains complete data including results.

**Implementation**: Extract tools from ~(plist-get info :tool-use)~ when callback
receives ~(cons 'tool-result ...)~ response.

**** 2. Use API-Provided Tool IDs

**Rationale**: LLM APIs provide stable tool use IDs (e.g., ~toolu_01ABC...~ from
Claude, ~call_XYZ...~ from OpenAI). These are better than generated IDs because:
- Stable across requests
- Traceable in API logs
- Match API billing/usage data
- Globally unique

**Implementation**: Extract ~:id~ field from tool-call plist.

**** 3. Serialize Arguments with prin1-to-string

**Rationale**: Initial implementation used ~json-encode~ but this failed on complex
Lisp data structures (special characters, nested structures). ~prin1-to-string~
handles any Lisp object correctly.

**Trade-off**: Output is Lisp syntax (harder to read in JSON) but always succeeds.

**** 4. Store Large Results in Separate Files

**Rationale**: Tool results can be very large (e.g., complete file contents). Storing
everything in metadata.json would make it unreadable and slow to parse.

**Implementation**: Results ≥1KB saved to ~jf/gptel-session-trace-tool-results-dirname/TOOL_ID.txt~, with 200-char
preview in metadata.

**** 5. Skip Callback Wrapping for Main Conversation

**Rationale**: Main conversation doesn't use ~:callback~ parameter - it uses gptel's
stream processor directly. Installing a callback breaks streaming (responses won't
appear in buffer).

**Implementation**: Check ~(and (not trace-id) (not existing-callback))~ and skip
wrapping entirely. This maintains complete transparency for main conversation.

**** 6. Dual Metadata Storage

**Rationale**: Tool calls are stored in BOTH session-level metadata (~metadata.json~)
and trace-level metadata (~traces/trace-N/metadata.json~) because:
- Session-level: Quick overview of all traces
- Trace-level: Self-contained trace analysis

**Implementation**: ~jf/gptel--record-complete-tool-call~ writes to both using alist
operations (JSON compatibility).

*** Error Handling

All tool capture code is wrapped in ~condition-case~ to prevent errors from breaking
the callback chain:

#+begin_src emacs-lisp :tangle no
(condition-case err
    (jf/gptel--record-complete-tool-call session-id trace-id tool-call)
  (error
   (message "ERROR capturing tool call: %s" (error-message-string err))))
#+end_src

If tool capture fails:
- Error logged to *Messages* buffer
- Original callback still runs
- Conversation continues normally
- Only tool metadata is lost (not the actual response)

** Known Limitations

*** 1. No Main Conversation Tool Capture

Agent tool invocations in the main conversation are not captured as structured
metadata. They're visible in response content but not in ~session_tool_calls~.

**Reason**: Preserving streaming transparency - wrapping callbacks breaks text insertion.

**Workaround**: Could parse response content in post-response hook (text parsing,
less reliable).

*** 2. No Millisecond-Precision Timestamps

Timestamps use ~format-time-string~ which provides second-level precision. Sub-second
timing data is not captured.

**Impact**: Can't measure tool execution time precisely.

**Workaround**: Would require using ~current-time~ and storing high-resolution timestamps.

*** 3. Alist/Plist Data Structure Mixing

Session metadata (from JSON) uses alists, but tool-call data starts as plists.
Must convert plists to alists before storing in trace metadata.

**Impact**: Implementation complexity, risk of format mismatch.

**Mitigation**: Explicit conversion in ~jf/gptel--record-complete-tool-call~.

*** 4. No Token Count Tracking

Tool results don't include token counts. The ~:tokens~ field in trace metadata
is always 0.

**Reason**: Token data not available in callback info plist.

**Impact**: Can't analyze token usage per tool call.

** Future Enhancements

