config/gptel/sessions/tracing.org
*** Possible Improvements

1. **Main conversation tool capture**: Parse response content in post-response hook
2. **Token counting**: Extract from API response metadata if available
3. **High-resolution timestamps**: Use ~current-time~ for microsecond precision
4. **Tool execution timing**: Calculate duration from start/end timestamps
5. **Tool success/failure status**: Add explicit success field (not just error)
6. **Compressed storage**: Gzip large tool results automatically
7. **Query interface**: Emacs functions to search tool calls by name, time, trace

*** Non-Goals

1. **Real-time tool monitoring**: This is post-hoc analysis, not live debugging
2. **Tool result modification**: Capture only, no replay or editing capability
3. **Cross-session analysis**: Each session is independent, no aggregation

** Testing and Validation

*** Verification Checklist

After implementing tool capture, verify:

- [ ] Tool calls appear in ~metadata.json~ under ~agent_traces[N].tool_calls~
- [ ] Tool calls appear in ~traces/trace-N/metadata.json~ under ~tool_calls~
- [ ] Large results (>1KB) saved to ~jf/gptel-session-trace-tool-results-dirname/~ with correct TOOL_ID filename
- [ ] Small results (<1KB) stored inline in ~result_preview~
- [ ] API-provided tool IDs present (not synthetic)
- [ ] Arguments serialized correctly as Lisp plists
- [ ] Error results captured (e.g., "Executable 'tree' not found")
- [ ] Multiple tools in single request all captured
- [ ] Timestamps in ISO 8601 format
- [ ] Main conversation streaming works normally
- [ ] No errors in *Messages* buffer during capture

*** Example Test Session

#+begin_src emacs-lisp :tangle no
;; 1. Start fresh isolated Emacs instance
;; 2. Open gptel buffer: M-x gptel
;; 3. Use Agent tool: "Use explorer agent to read ~/Brewfile"
;; 4. Wait for completion
;; 5. Check session directory: ~/gptel-sessions/LATEST/
;; 6. Verify metadata.json has populated tool_calls arrays
;; 7. Verify trace-1/metadata.json matches
;; 8. Check jf/gptel-session-trace-tool-results-dirname/ directory for large results
#+end_src

** Related Documentation

- ~hooks.org~: Callback wrapping mechanism and advice installation
- ~registry.org~: Session state management and trace stack
- ~metadata.org~: Conversation tree and file management
- ~tracing.org~: This file - tool capture implementation
- Message storage (prompts, responses, results)
- Trace hierarchy management

* Lexical Binding

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
(require 'cl-lib)
#+end_src

* Create Trace

#+begin_src emacs-lisp
(defun jf/gptel--create-trace (session-id agent-type description prompt &optional parent-trace-id)
  "Create new agent trace entry in session.
Looks up session from registry, updates metadata, returns trace-id."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata)))
    (let* ((trace-counter (plist-get session-data :trace-counter))
           (trace-id (format "%s%d" jf/gptel-session-node-prefix-trace (cl-incf trace-counter)))
           (trace-stack (plist-get session-data :trace-stack))
           (depth (length trace-stack))
           (trace (list :trace_id trace-id
                       :agent_type agent-type
                       :description description
                       :prompt_preview (substring prompt 0 (min 200 (length prompt)))
                       :timestamp_start (format-time-string "%Y-%m-%dT%H:%M:%SZ")
                       :timestamp_end nil
                       :status "running"
                       :parent_trace_id parent-trace-id
                       :depth depth
                       :tool_calls []
                       :associated_nodes nil)))
      ;; Update registry: increment counter, push to stack
      (jf/gptel--update-session-data session-id :trace-counter trace-counter)
      (jf/gptel--update-session-data session-id :trace-stack (cons trace-id trace-stack))

      ;; Add to metadata's agent_traces array
      (let ((traces (plist-get metadata :agent_traces)))
        (plist-put metadata :agent_traces
                   (vconcat traces (vector trace))))

      ;; Write metadata to disk (incremental)
      (let ((session-dir (plist-get session-data :directory)))
        (jf/gptel--write-metadata session-dir metadata))

      trace-id)))
#+end_src

* Complete Trace

#+begin_src emacs-lisp
(defun jf/gptel--complete-trace (session-id trace-id status)
  "Mark trace as completed, pop from stack."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata))
              (traces (plist-get metadata :agent_traces)))
    ;; Find and update the trace
    (let ((trace (cl-find-if (lambda (tr)
                              (equal (plist-get tr :trace_id) trace-id))
                            (append traces nil))))
      (when trace
        (plist-put trace :timestamp_end (format-time-string "%Y-%m-%dT%H:%M:%SZ"))
        (plist-put trace :status status)

        ;; Pop from trace stack in registry
        (let ((trace-stack (plist-get session-data :trace-stack)))
          (jf/gptel--update-session-data session-id :trace-stack
                                        (remove trace-id trace-stack)))

        ;; Write metadata to disk
        (let ((session-dir (plist-get session-data :directory)))
          (jf/gptel--write-metadata session-dir metadata))))))
#+end_src

* Current Trace ID

#+begin_src emacs-lisp
(defun jf/gptel--current-trace-id (session-id)
  "Get current trace ID (top of stack) from session."
  (when-let ((session-data (jf/gptel--get-session-data session-id)))
    (car (plist-get session-data :trace-stack))))
#+end_src

* Tool Call Recording

** Generate Tool Use ID

#+begin_src emacs-lisp
(defun jf/gptel--generate-tool-use-id (tool-name)
  "Generate a tool use ID in Claude API format.
Returns format: toolu_TIMESTAMP_RANDOM."
  (format "toolu_%s_%04x"
          (format-time-string "%Y%m%d%H%M%S")
          (random 65536)))
#+end_src

