config/gptel/sessions/tracing.el

(defun jf/gptel--record-complete-tool-call (session-id trace-id tool-call-plist)
  "Record a complete tool call with ID, name, args, and result.
TOOL-CALL-PLIST has :id, :name, :args, and :result from gptel.
If TRACE-ID is nil, records to session-level. Otherwise records to trace."
  (let* ((tool-id (plist-get tool-call-plist :id))
         (tool-name (plist-get tool-call-plist :name))
         (args (plist-get tool-call-plist :args))
         (result (plist-get tool-call-plist :result))
         (args-str (prin1-to-string args))
         (timestamp (format-time-string "%Y-%m-%dT%H:%M:%SZ"))
         ;; Convert result to string
         (result-str (cond
                      ((stringp result) result)
                      ((listp result) (format "%S" result))
                      (t (format "%s" result))))
         ;; Create tool call entry
         (tool-call (list :tool_use_id tool-id
                         :tool_name tool-name
                         :timestamp timestamp
                         :args_str args-str
                         :result_preview nil
                         :result_file nil
                         :error nil)))

    ;; Decide storage strategy for result
    (if (< (length result-str) 1024)
        ;; Small result: store inline
        (plist-put tool-call :result_preview
                  (jf/gptel--preview-string result-str 500))
      ;; Large result: save to file
      (when-let* ((session-data (jf/gptel--get-session-data session-id))
                  (session-dir (plist-get session-data :directory)))
        (let* ((results-dir (if trace-id
                               (expand-file-name
                                (format "%s/%s/%s"
                                        jf/gptel-session-traces-dirname
                                        trace-id
                                        jf/gptel-session-trace-tool-results-dirname)
                                session-dir)
                             (expand-file-name jf/gptel-session-trace-tool-results-dirname session-dir)))
               (result-file (format "%s.txt" tool-id))
               (result-path (expand-file-name result-file results-dir)))
          (make-directory results-dir t)
          (with-temp-file result-path
            (insert result-str))
          (plist-put tool-call :result_preview
                    (jf/gptel--preview-string result-str 200))
          (plist-put tool-call :result_file result-file))))

    ;; Store in appropriate location
    (when-let* ((session-data (jf/gptel--get-session-data session-id))
                (metadata (plist-get session-data :metadata)))
      (if trace-id
          ;; Store in trace
          (when-let* ((traces (plist-get metadata :agent_traces))
                      (trace (cl-find-if (lambda (tr)
                                          (equal (plist-get tr :trace_id) trace-id))
                                        (append traces nil))))
            (let ((calls (plist-get trace :tool_calls)))
              (plist-put trace :tool_calls (vconcat calls (vector tool-call)))))
        ;; Store in session
        (let ((calls (or (plist-get metadata :session_tool_calls) [])))
          (plist-put metadata :session_tool_calls (vconcat calls (vector tool-call)))))

      ;; Write session metadata immediately
      (let ((session-dir (plist-get session-data :directory)))
        (jf/gptel--write-metadata session-dir metadata))

      ;; Also update trace directory metadata if this is a trace
      (when trace-id
        (when-let* ((session-dir (plist-get session-data :directory))
                    (trace-dir (expand-file-name (format "%s/%s" jf/gptel-session-traces-dirname trace-id) session-dir))
                    (metadata-file (expand-file-name jf/gptel-session-trace-metadata-filename trace-dir)))
          (let* ((trace-metadata (if (file-exists-p metadata-file)
                                    (with-temp-buffer
                                      (insert-file-contents metadata-file)
                                      (goto-char (point-min))
                                      (json-read))
                                  ;; Initial structure as alist (compatible with json-read output)
                                  (list (cons 'trace_id trace-id)
                                        (cons 'messages [])
                                        (cons 'tool_calls [])
                                        (cons 'total_tokens 0))))
                 ;; Use alist-get since json-read returns alist
                 (tool-calls (alist-get 'tool_calls trace-metadata))
                 ;; Convert tool-call plist to alist for JSON encoding
                 (tool-call-alist
                  (list (cons 'tool_use_id (plist-get tool-call :tool_use_id))
                        (cons 'tool_name (plist-get tool-call :tool_name))
                        (cons 'timestamp (plist-get tool-call :timestamp))
                        (cons 'args_str (plist-get tool-call :args_str))
                        (cons 'result_preview (plist-get tool-call :result_preview))
                        (cons 'result_file (plist-get tool-call :result_file))
                        (cons 'error (plist-get tool-call :error)))))
            ;; Update tool_calls in alist using setf
            (setf (alist-get 'tool_calls trace-metadata)
                  (vconcat tool-calls (vector tool-call-alist)))
            ;; Write updated trace metadata
            (make-directory trace-dir t)
            (with-temp-file metadata-file
              (let ((json-encoding-pretty-print t))
                (insert (json-encode trace-metadata))))))))))
