config/gptel/sessions/tracing.org
** OLD: Record Tool Call Result (Deprecated)

#+begin_src emacs-lisp :tangle no
(defun jf/gptel--record-tool-call-result (session-id trace-id tool-name args result)
  "Update tool call with result after execution.
Finds matching tool call by TOOL-NAME and ARGS, updates with RESULT."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata))
              (traces (plist-get metadata :agent_traces)))
    (let ((trace (cl-find-if (lambda (tr)
                              (equal (plist-get tr :trace_id) trace-id))
                            (append traces nil))))
      (when trace
        (let* ((tool-calls (plist-get trace :tool_calls))
               (args-str (prin1-to-string args))
               ;; Find matching tool call (by name, args, and null result)
               (tool-call (cl-find-if
                          (lambda (tc)
                            (and (equal (plist-get tc :tool_name) tool-name)
                                 (equal (plist-get tc :args_str) args-str)
                                 (null (plist-get tc :timestamp_result))))
                          (append tool-calls nil))))
          (when tool-call
            ;; Convert result to string
            (let ((result-str (cond
                               ((stringp result) result)
                               ((listp result) (format "%S" result))
                               (t (format "%s" result)))))
              ;; Decide storage strategy based on result size
              (if (< (length result-str) 1024)
                  ;; Small result: store inline
                  (progn
                    (plist-put tool-call :result_preview
                              (jf/gptel--preview-string result-str 500))
                    (plist-put tool-call :result_file nil))
                ;; Large result: save to file
                (let* ((session-dir (plist-get session-data :directory))
                       (trace-dir (expand-file-name
                                  (format "%s/%s" jf/gptel-session-traces-dirname trace-id) session-dir))
                       (results-dir (expand-file-name jf/gptel-session-trace-tool-results-dirname trace-dir))
                       (tool-use-id (plist-get tool-call :tool_use_id))
                       (result-file (format "%s.txt" tool-use-id))
                       (result-path (expand-file-name result-file results-dir)))
                  ;; Create directory
                  (make-directory results-dir t)
                  ;; Save result to file
                  (with-temp-file result-path
                    (insert result-str))
                  ;; Update metadata
                  (plist-put tool-call :result_preview
                            (jf/gptel--preview-string result-str 200))
                  (plist-put tool-call :result_file result-file)))

              ;; Update timestamp
              (plist-put tool-call :timestamp_result
                        (format-time-string "%Y-%m-%dT%H:%M:%SZ"))))

          ;; Write metadata immediately
          (let ((session-dir (plist-get session-data :directory)))
            (jf/gptel--write-metadata session-dir metadata)))))))
#+end_src

** OLD: Record Tool Call Error (Deprecated)

#+begin_src emacs-lisp :tangle no
(defun jf/gptel--record-tool-call-error (session-id trace-id tool-name args error-msg)
  "Record tool call error.
Finds matching tool call and marks it with ERROR-MSG."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata))
              (traces (plist-get metadata :agent_traces)))
    (let ((trace (cl-find-if (lambda (tr)
                              (equal (plist-get tr :trace_id) trace-id))
                            (append traces nil))))
      (when trace
        (let* ((tool-calls (plist-get trace :tool_calls))
               (args-str (prin1-to-string args))
               (tool-call (cl-find-if
                          (lambda (tc)
                            (and (equal (plist-get tc :tool_name) tool-name)
                                 (equal (plist-get tc :args_str) args-str)
                                 (null (plist-get tc :timestamp_result))))
                          (append tool-calls nil))))
          (when tool-call
            (plist-put tool-call :error error-msg)
            (plist-put tool-call :timestamp_result
                      (format-time-string "%Y-%m-%dT%H:%M:%SZ"))
            (let ((session-dir (plist-get session-data :directory)))
              (jf/gptel--write-metadata session-dir metadata))))))))
#+end_src

* OLD: Session-Level Tool Call Recording (Deprecated)

These functions are deprecated. Use jf/gptel--record-complete-tool-call instead.

** OLD: Record Initial Session Tool Call (Deprecated)

#+begin_src emacs-lisp :tangle no
(defun jf/gptel--record-session-tool-call-initial (session-id tool args)
  "Record tool call in main conversation (not a trace).
TOOL is the tool object, ARGS is the arguments plist."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata)))
    (let* ((tool-name (gptel-tool-name tool))
           (tool-use-id (jf/gptel--generate-tool-use-id tool-name))
           (args-str (prin1-to-string args))
           (tool-call (list :tool_use_id tool-use-id
                           :tool_name tool-name
                           :timestamp_call (format-time-string "%Y-%m-%dT%H:%M:%SZ")
                           :timestamp_result nil
                           :args_str args-str
                           :result_preview nil
                           :result_file nil
                           :error nil)))
      ;; Get or create session_tool_calls array
      (let ((calls (or (plist-get metadata :session_tool_calls) [])))
        (plist-put metadata :session_tool_calls (vconcat calls (vector tool-call))))

      ;; Write metadata immediately
      (let ((session-dir (plist-get session-data :directory)))
        (jf/gptel--write-metadata session-dir metadata)))))
#+end_src

** OLD: Record Session Tool Call Result (Deprecated)

#+begin_src emacs-lisp :tangle no
(defun jf/gptel--record-session-tool-call-result (session-id tool-name args result)
  "Update session-level tool call with result.
Finds matching tool call by TOOL-NAME and ARGS, updates with RESULT."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata)))
    (let* ((tool-calls (plist-get metadata :session_tool_calls))
           (args-str (prin1-to-string args))
           ;; Find matching tool call
           (tool-call (cl-find-if
                      (lambda (tc)
                        (and (equal (plist-get tc :tool_name) tool-name)
                             (equal (plist-get tc :args_str) args-str)
                             (null (plist-get tc :timestamp_result))))
                      (append tool-calls nil))))
      (when tool-call
        ;; Convert result to string
        (let ((result-str (cond
                           ((stringp result) result)
                           ((listp result) (format "%S" result))
                           (t (format "%s" result)))))
          ;; Decide storage strategy
          (if (< (length result-str) 1024)
              ;; Small result: store inline
              (progn
                (plist-put tool-call :result_preview
                          (jf/gptel--preview-string result-str 500))
                (plist-put tool-call :result_file nil))
            ;; Large result: save to file
            (let* ((session-dir (plist-get session-data :directory))
                   (results-dir (expand-file-name jf/gptel-session-trace-tool-results-dirname session-dir))
                   (tool-use-id (plist-get tool-call :tool_use_id))
                   (result-file (format "%s.txt" tool-use-id))
                   (result-path (expand-file-name result-file results-dir)))
              (make-directory results-dir t)
              (with-temp-file result-path
                (insert result-str))
              (plist-put tool-call :result_preview
                        (jf/gptel--preview-string result-str 200))
              (plist-put tool-call :result_file result-file)))

          ;; Update timestamp
          (plist-put tool-call :timestamp_result
                    (format-time-string "%Y-%m-%dT%H:%M:%SZ"))))

      ;; Write metadata immediately
      (let ((session-dir (plist-get session-data :directory)))
        (jf/gptel--write-metadata session-dir metadata)))))
#+end_src

** OLD: Record Session Tool Call Error (Deprecated)

#+begin_src emacs-lisp :tangle no
(defun jf/gptel--record-session-tool-call-error (session-id tool-name args error-msg)
  "Record session-level tool call error."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (metadata (plist-get session-data :metadata)))
    (let* ((tool-calls (plist-get metadata :session_tool_calls))
           (args-str (prin1-to-string args))
           (tool-call (cl-find-if
                      (lambda (tc)
                        (and (equal (plist-get tc :tool_name) tool-name)
                             (equal (plist-get tc :args_str) args-str)
                             (null (plist-get tc :timestamp_result))))
                      (append tool-calls nil))))
      (when tool-call
        (plist-put tool-call :error error-msg)
        (plist-put tool-call :timestamp_result
                  (format-time-string "%Y-%m-%dT%H:%M:%SZ"))
        (let ((session-dir (plist-get session-data :directory)))
          (jf/gptel--write-metadata session-dir metadata))))))
#+end_src

* Preview String

#+begin_src emacs-lisp
(defun jf/gptel--preview-string (obj &optional max-len)
  "Create preview string from OBJ (string, list, etc)."
  (let* ((max-len (or max-len 200))
         (str (cond
               ((stringp obj) obj)
               ((listp obj) (format "%S" obj))
               (t (format "%s" obj)))))
    (if (> (length str) max-len)
        (concat (substring str 0 max-len) "...")
      str)))
#+end_src

