config/gptel/sessions/tracing.el

(defun jf/gptel--preview-string (obj &optional max-len)
  "Create preview string from OBJ (string, list, etc)."
  (let* ((max-len (or max-len 200))
         (str (cond
               ((stringp obj) obj)
               ((listp obj) (format "%S" obj))
               (t (format "%s" obj)))))
    (if (> (length str) max-len)
        (concat (substring str 0 max-len) "...")
      str)))
