config/gptel/sessions/tracing.org
* Save Trace Message

#+begin_src emacs-lisp
(defun jf/gptel--save-trace-message (session-id trace-id message-type content &optional metadata)
  "Save a message to trace directory.
MESSAGE-TYPE is 'prompt', 'message', 'response', or 'result'.
CONTENT is the message text.
METADATA is optional plist with :timestamp, :tokens, :tool_calls, etc."
  (when-let* ((session-data (jf/gptel--get-session-data session-id))
              (session-dir (plist-get session-data :directory)))
    (let* ((trace-dir (expand-file-name (format "%s/%s" jf/gptel-session-traces-dirname trace-id) session-dir))
           (metadata-file (expand-file-name jf/gptel-session-trace-metadata-filename trace-dir))
           ;; Count existing message files to get next ID
           (message-files (when (file-directory-p trace-dir)
                           (directory-files trace-dir nil "^\\(message\\|response\\)-[0-9]+\\.txt$")))
           (next-id (if message-files (length message-files) 0))
           (file-name (pcase message-type
                       ('prompt "prompt.txt")
                       ('result "result.txt")
                       ('message (format "message-%d.txt" next-id))
                       ('response (format "response-%d.txt" next-id))))
           (file-path (expand-file-name file-name trace-dir)))

      ;; Create trace directory if needed
      (make-directory trace-dir t)

      ;; Save message content
      (with-temp-file file-path
        (insert content))

      ;; Update trace metadata
      (let* ((trace-metadata (if (file-exists-p metadata-file)
                                (with-temp-buffer
                                  (insert-file-contents metadata-file)
                                  (let ((json-object-type 'plist)
                                        (json-array-type 'vector)
                                        (json-key-type 'keyword))
                                    (json-read)))
                              ;; Initialize if doesn't exist
                              (list :trace_id trace-id
                                    :messages []
                                    :tool_calls []
                                    :total_tokens 0)))
             (messages (plist-get trace-metadata :messages))
             (new-message (list :id file-name
                               :file file-name
                               :timestamp (or (plist-get metadata :timestamp)
                                            (format-time-string "%Y-%m-%dT%H:%M:%SZ"))
                               :tokens (or (plist-get metadata :tokens) 0))))
        ;; Add optional fields
        (when (plist-get metadata :tool_calls)
          (plist-put new-message :tool_calls (plist-get metadata :tool_calls)))

        ;; Append to messages array
        (plist-put trace-metadata :messages
                   (vconcat messages (vector new-message)))

        ;; Update total tokens
        (plist-put trace-metadata :total_tokens
                   (+ (or (plist-get trace-metadata :total_tokens) 0)
                      (or (plist-get metadata :tokens) 0)))

        ;; Write updated metadata
        (with-temp-file metadata-file
          (let ((json-encoding-pretty-print t))
            (insert (json-encode trace-metadata))))))))
#+end_src
